# TASK2

In [33]:
import numpy as np
import pandas as pd
np.set_printoptions(precision=2)
pd.set_option('display.max.columns', 100)

In [34]:
data = pd.read_csv('./mlcourse/data/adult.data.csv')

In [35]:
data.head(10)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K

In [36]:
data.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [37]:
# data.plot(kind='bar')

In [38]:
#1 How many men and women (sex feature) are represented in this dataset?
data.groupby('sex').count()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,capital-gain,capital-loss,hours-per-week,native-country,salary
sex,,,,,,,,,,,,,,
Female,10771,10771,10771,10771,10771,10771,10771,10771,10771,10771,10771,10771,10771,10771
Male,21790,21790,21790,21790,21790,21790,21790,21790,21790,21790,21790,21790,21790,21790

In [39]:
# Вот так лучше
pd.crosstab(data['sex'], data['sex'].count())

col_0   32561
sex
Female  10771
Male    21790

In [40]:
# 2 What is the average age (age feature) of women?
data[data['sex'] == 'Female'].age.mean()

36.85823043357163

In [41]:
# 3 What is the percentage of German citizens (native-country feature)?
allpeople = data.count()
germans = data[data['native-country'] == 'Germany'].count()
print('German people % : ', germans / allpeople * 100)

German people % :  age               0.420749
workclass         0.420749
fnlwgt            0.420749
education         0.420749
education-num     0.420749
marital-status    0.420749
occupation        0.420749
relationship      0.420749
race              0.420749
sex               0.420749
capital-gain      0.420749
capital-loss      0.420749
hours-per-week    0.420749
native-country    0.420749
salary            0.420749
dtype: float64

In [42]:
# 4-5 What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?
data[data['salary'] == '>50K']['age'].mean(), \
data[data['salary'] == '<=50K']['age'].mean()

(44.24984058155847, 36.78373786407767)

In [43]:
data[data['salary'] == '>50K']['age'].std(), \
data[data['salary'] == '<=50K']['age'].std()

(10.51902771985177, 14.020088490824813)

In [44]:
# 6 Is it true that people who earn more than 50K have at least high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)
# data[data['salary'] == '>50K']['education'].count()
data.groupby([data['salary'] == '>50K', 'education']).count()
#false

                      age  workclass  fnlwgt  education-num  marital-status  \
salary education
False  10th           871        871     871            871             871
       11th          1115       1115    1115           1115            1115
       12th           400        400     400            400             400
       1st-4th        162        162     162            162             162
       5th-6th        317        317     317            317             317
       7th-8th        606        606     606            606             606
       9th            487        487     487            487             487
       Assoc-acdm     802        802     802            802             802
       Assoc-voc     1021       1021    1021           1021            1021
       Bachelors     3134       3134    3134           3134            3134
       Doctorate      107        107     107            107             107
       HS-grad       8826       8826    8826           8826            8826
       Masters        764        764     764            764             764
       Preschool       51         51      51             51              51
       Prof-school    153        153     153            153             153
       Some-college  5904       5904    5904           5904            5904
True   10th            62         62      62             62              62
       11th            60         60      60             60              60
       12th            33         33      33             33              33
       1st-4th          6          6       6              6               6
       5th-6th         16         16      16             16              16
       7th-8th         40         40      40             40              40
       9th             27         27      27             27              27
       Assoc-acdm     265        265     265            265             265
       Assoc-voc      361        361     361            361             361
       Bachelors     2221       2221    2221           2221            2221
       Doctorate      306        306     306            306             306
       HS-grad       1675       1675    1675           1675            1675
       Masters        959        959     959            959             959
       Prof-school    423        423     423            423             423
       Some-college  1387       1387    1387           1387            1387

                     occupation  relationship  race   sex  capital-gain  \
salary education
False  10th                 871           871   871   871           871
       11th                1115          1115  1115  1115          1115
       12th                 400           400   400   400           400
       1st-4th              162           162   162   162           162
       5th-6th              317           317   317   317           317
       7th-8th              606           606   606   606           606
       9th                  487           487   487   487           487
       Assoc-acdm           802           802   802   802           802
       Assoc-voc           1021          1021  1021  1021          1021
       Bachelors           3134          3134  3134  3134          3134
       Doctorate            107           107   107   107           107
       HS-grad             8826          8826  8826  8826          8826
       Masters              764           764   764   764           764
       Preschool             51            51    51    51            51
       Prof-school          153           153   153   153           153
       Some-college        5904          5904  5904  5904          5904
True   10th                  62            62    62    62            62
       11th                  60            60    60    60            60
       12th                  33            33    33    33            33
       1st-4th                6             6     6     6             6
       5th-6th               16            16    16    16            16
       7th-8th               40            40    40    40            40
       9th                   27            27    27    27            27
       Assoc-acdm           265           265   265   265           265
       Assoc-voc            361           361   361   361           361
       Bachelors           2221          2221  2221  2221          2221
       Doctorate            306           306   306   306           306
       HS-grad             1675          1675  1675  1675          1675
       Masters              959           959   959   959           959
       Prof-school          423           423   423   423           423
       Some-college        1387          1387  1387  1387          1387

                     capital-loss  hours-per-week  native-country  salary
salary education
False  10th                   871             871             871     871
       11th                  1115            1115            1115    1115
       12th                   400             400             400     400
       1st-4th                162             162             162     162
       5th-6th                317             317             317     317
       7th-8th                606             606             606     606
       9th                    487             487             487     487
       Assoc-acdm             802             802             802     802
       Assoc-voc             1021            1021            1021    1021
       Bachelors             3134            3134            3134    3134
       Doctorate              107             107             107     107
       HS-grad               8826            8826            8826    8826
       Masters                764             764             764     764
       Preschool               51              51              51      51
       Prof-school            153             153             153     153
       Some-college          5904            5904            5904    5904
True   10th                    62              62              62      62
       11th                    60              60              60      60
       12th                    33              33              33      33
       1st-4th                  6               6               6       6
       5th-6th                 16              16              16      16
       7th-8th                 40              40              40      40
       9th                     27              27              27      27
       Assoc-acdm             265             265             265     265
       Assoc-voc              361             361             361     361
       Bachelors             2221            2221            2221    2221
       Doctorate              306             306             306     306
       HS-grad               1675            1675            1675    1675
       Masters                959             959             959     959
       Prof-school            423             423             423     423
       Some-college          1387            1387            1387    1387

In [45]:
# 7 Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.
data.groupby('race')['age'].describe(), \
data.groupby('sex')['age'].describe()
#maximum age = 82

(                      count       mean        std   min   25%   50%   75%  \
 race
 Amer-Indian-Eskimo    311.0  37.173633  12.447130  17.0  28.0  35.0  45.5
 Asian-Pac-Islander   1039.0  37.746872  12.825133  17.0  28.0  36.0  45.0
 Black                3124.0  37.767926  12.759290  17.0  28.0  36.0  46.0
 Other                 271.0  33.457565  11.538865  17.0  25.0  31.0  41.0
 White               27816.0  38.769881  13.782306  17.0  28.0  37.0  48.0

                      max
 race
 Amer-Indian-Eskimo  82.0
 Asian-Pac-Islander  90.0
 Black               90.0
 Other               77.0
 White               90.0  ,
           count       mean        std   min   25%   50%   75%   max
 sex
 Female  10771.0  36.858230  14.013697  17.0  25.0  35.0  46.0  90.0
 Male    21790.0  39.433547  13.370630  17.0  29.0  38.0  48.0  90.0)

In [46]:
# 8 Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.
data['marital-status'].value_counts()

Married-civ-spouse       14976
Never-married            10683
Divorced                  4443
Separated                 1025
Widowed                    993
Married-spouse-absent      418
Married-AF-spouse           23
Name: marital-status, dtype: int64

In [47]:
Married =  data[((data['marital-status'] == 'Married-AF-spouse') | (data['marital-status'] == 'Married-spouse-absent') | (data['marital-status'] == 'Married-civ-spouse')) & (data['salary'] == '>50K') & (data['sex'] == 'Male')].count()

NoMarried = data[((data['marital-status'] == 'Divorced') | (data['marital-status'] == 'Separated') | (data['marital-status'] == 'Widowed') | (data['marital-status'] == 'Never-married')) & (data['salary'] == '>50K') & (data['sex'] == 'Male')].count()

print('Married >50K - ', Married['sex'])
print('NoMarried >50K - ', NoMarried['salary'])

pd.crosstab(Married, NoMarried)

Married >50K -  5965
NoMarried >50K -  697

col_0  697
row_0
5965    15

In [48]:
# 9 What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?
data['hours-per-week'].max()

99

In [49]:
data[data['hours-per-week'] == 99].count()

age               85
workclass         85
fnlwgt            85
education         85
education-num     85
marital-status    85
occupation        85
relationship      85
race              85
sex               85
capital-gain      85
capital-loss      85
hours-per-week    85
native-country    85
salary            85
dtype: int64

In [50]:
data[(data['hours-per-week'] == 99) & (data['salary'] == '>50K')].count()

age               25
workclass         25
fnlwgt            25
education         25
education-num     25
marital-status    25
occupation        25
relationship      25
race              25
sex               25
capital-gain      25
capital-loss      25
hours-per-week    25
native-country    25
salary            25
dtype: int64

In [51]:
# in %:
print(data[(data['hours-per-week'] == 99) & (data['salary'] == '>50K')].count() / data[data['hours-per-week'] == 99].count() * 100)

age               29.411765
workclass         29.411765
fnlwgt            29.411765
education         29.411765
education-num     29.411765
marital-status    29.411765
occupation        29.411765
relationship      29.411765
race              29.411765
sex               29.411765
capital-gain      29.411765
capital-loss      29.411765
hours-per-week    29.411765
native-country    29.411765
salary            29.411765
dtype: float64

In [52]:
# 10 Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?
allCountries = data.groupby(['salary', 'native-country'])['hours-per-week'].mean()
allCountries

salary  native-country
<=50K   ?                  40.164760
        Cambodia           41.416667
        Canada             37.914634
        China              37.381818
        Columbia           38.684211
                             ...
>50K    Thailand           58.333333
        Trinadad&Tobago    40.000000
        United-States      45.505369
        Vietnam            39.200000
        Yugoslavia         49.500000
Name: hours-per-week, Length: 82, dtype: float64

In [53]:
Japan = data[data['native-country'] == 'Japan'].groupby(['salary', 'native-country'])['hours-per-week'].mean()
Japan

salary  native-country
<=50K   Japan             41.000000
>50K    Japan             47.958333
Name: hours-per-week, dtype: float64

In [54]:
# 11 Какой процент мужчин (от всех мужчин) и женщин (от всех женщин), работающих в государственных компаниях, получает >50K?  

# 12Среди людей, получающих <=50K, какова медиана количества рабочих часов? А если посчитать отдельно по мужчинам и отдельно по женщинам? 

#13 Среди всех высокооплачиваемых людей (>50K) больше людей с высшим образованием, которые работают больше 50 часов в неделю и тех, кто не имеет высшего образование и работает не больше 50 часов в неделю?

In [55]:
#11  - OTBET: 1.3%(Male) 0.63%(Female)
Gov = data[(data['workclass']=='State-gov') & (data['salary']=='>50K')].groupby(['sex']).count()
Gov

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,capital-gain,capital-loss,hours-per-week,native-country,salary
sex,,,,,,,,,,,,,,
Female,68,68,68,68,68,68,68,68,68,68,68,68,68,68
Male,285,285,285,285,285,285,285,285,285,285,285,285,285,285

In [56]:
All = data.groupby('sex').count()

# All

In [57]:
(Gov / All) * 100

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,capital-gain,capital-loss,hours-per-week,native-country,salary
sex,,,,,,,,,,,,,,
Female,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325,0.631325
Male,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939,1.307939

In [58]:
# 12 OTBET - 40.7(Male), 36(Female)
data[data['salary'] == '<=50K'].groupby('sex')['hours-per-week'].median()

sex
Female    40
Male      40
Name: hours-per-week, dtype: int64

In [59]:
All = data[data['salary'] == '>50K']
HighEdu = All[(data['education'] == 'HS-grad') & (data['hours-per-week'] > 50)]
NoHighEdu = All[(data['education'] != 'HS-grad') & (data['hours-per-week'] < 50)]

Answer =  All.count()/(HighEdu.count()+NoHighEdu.count())
if 1 / Answer['age'] > .5:
    print('OTBET - Da')
else: 
    print('OTBET - Net')
print(
    '>50K: \n'
    'Все - ', All['age'].count(), '\n'
    'С высшим (>50 ч/неделю)- ', HighEdu['age'].count(), '\n'
    'Без высшего (<50 ч/неделю)', NoHighEdu['age'].count(), '\n'   
 )

OTBET - Da
>50K:
Все -  7841
С высшим (>50 ч/неделю)-  296
Без высшего (<50 ч/неделю) 3866

In [60]:
data['education'].value_counts()

HS-grad         10501
Some-college     7291
Bachelors        5355
Masters          1723
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           333
1st-4th           168
Preschool          51
Name: education, dtype: int64